In [ ]:
import numpy as np
import pandas as pd

In [2]:
data = np.random.randn(4,3)

In [3]:
data

array([[-0.55057749, -0.43614278, -1.34291832],
       [-0.99435442,  1.66168726, -0.98201712],
       [ 0.92192012, -0.56740725, -0.28273652],
       [ 0.54635615, -0.40651638,  0.53739968]])

In [4]:
dataFrame = pd.DataFrame(data)

In [5]:
dataFrame

          0         1         2
0 -0.550577 -0.436143 -1.342918
1 -0.994354  1.661687 -0.982017
2  0.921920 -0.567407 -0.282737
3  0.546356 -0.406516  0.537400

In [6]:
dataFrame[0]

0   -0.550577
1   -0.994354
2    0.921920
3    0.546356
Name: 0, dtype: float64

In [7]:
yeniDataFrame = pd.DataFrame(data, index=["Sema","Tolga","Melis","Venüs"], columns=["Maaş","Yaş","Çalışma Saati"])

In [8]:
yeniDataFrame

           Maaş       Yaş  Çalışma Saati
Sema  -0.550577 -0.436143      -1.342918
Tolga -0.994354  1.661687      -0.982017
Melis  0.921920 -0.567407      -0.282737
Venüs  0.546356 -0.406516       0.537400

In [9]:
yeniDataFrame["Yaş"]

Sema    -0.436143
Tolga    1.661687
Melis   -0.567407
Venüs   -0.406516
Name: Yaş, dtype: float64

In [10]:
yeniDataFrame[["Maaş","Çalışma Saati"]]

           Maaş  Çalışma Saati
Sema  -0.550577      -1.342918
Tolga -0.994354      -0.982017
Melis  0.921920      -0.282737
Venüs  0.546356       0.537400

In [11]:
yeniDataFrame.loc["Venüs"]

Maaş             0.546356
Yaş             -0.406516
Çalışma Saati    0.537400
Name: Venüs, dtype: float64

In [12]:
yeniDataFrame.iloc[2]

Maaş             0.921920
Yaş             -0.567407
Çalışma Saati   -0.282737
Name: Melis, dtype: float64

In [13]:
yeniDataFrame["Emeklilik Yaşı"] = yeniDataFrame["Yaş"] + yeniDataFrame["Yaş"]

In [14]:
yeniDataFrame

           Maaş       Yaş  Çalışma Saati  Emeklilik Yaşı
Sema  -0.550577 -0.436143      -1.342918       -0.872286
Tolga -0.994354  1.661687      -0.982017        3.323375
Melis  0.921920 -0.567407      -0.282737       -1.134814
Venüs  0.546356 -0.406516       0.537400       -0.813033

In [15]:
yeniDataFrame.drop("Emeklilik Yaşı", axis=1)

           Maaş       Yaş  Çalışma Saati
Sema  -0.550577 -0.436143      -1.342918
Tolga -0.994354  1.661687      -0.982017
Melis  0.921920 -0.567407      -0.282737
Venüs  0.546356 -0.406516       0.537400

In [16]:
yeniDataFrame.drop("Tolga", axis=0)

           Maaş       Yaş  Çalışma Saati  Emeklilik Yaşı
Sema  -0.550577 -0.436143      -1.342918       -0.872286
Melis  0.921920 -0.567407      -0.282737       -1.134814
Venüs  0.546356 -0.406516       0.537400       -0.813033

In [17]:
yeniDataFrame

           Maaş       Yaş  Çalışma Saati  Emeklilik Yaşı
Sema  -0.550577 -0.436143      -1.342918       -0.872286
Tolga -0.994354  1.661687      -0.982017        3.323375
Melis  0.921920 -0.567407      -0.282737       -1.134814
Venüs  0.546356 -0.406516       0.537400       -0.813033

In [18]:
yeniDataFrame.drop("Emeklilik Yaşı", axis = 1, inplace=True)

In [19]:
yeniDataFrame

           Maaş       Yaş  Çalışma Saati
Sema  -0.550577 -0.436143      -1.342918
Tolga -0.994354  1.661687      -0.982017
Melis  0.921920 -0.567407      -0.282737
Venüs  0.546356 -0.406516       0.537400

In [20]:
yeniDataFrame.loc["Sema"]["Maaş"]

-0.5505774885354447

In [21]:
yeniDataFrame.loc["Melis","Yaş"]

-0.5674072497255616

In [22]:
yeniDataFrame < 0

        Maaş    Yaş  Çalışma Saati
Sema    True   True           True
Tolga   True  False           True
Melis  False   True           True
Venüs  False   True          False

In [23]:
booleanFrame = yeniDataFrame <0

In [24]:
booleanFrame

        Maaş    Yaş  Çalışma Saati
Sema    True   True           True
Tolga   True  False           True
Melis  False   True           True
Venüs  False   True          False

In [25]:
yeniDataFrame[yeniDataFrame < 0]

           Maaş       Yaş  Çalışma Saati
Sema  -0.550577 -0.436143      -1.342918
Tolga -0.994354       NaN      -0.982017
Melis       NaN -0.567407      -0.282737
Venüs       NaN -0.406516            NaN

In [26]:
yeniDataFrame[yeniDataFrame["Yaş"] > 0]

           Maaş       Yaş  Çalışma Saati
Tolga -0.994354  1.661687      -0.982017

In [27]:
yeniDataFrame.reset_index()

   index      Maaş       Yaş  Çalışma Saati
0   Sema -0.550577 -0.436143      -1.342918
1  Tolga -0.994354  1.661687      -0.982017
2  Melis  0.921920 -0.567407      -0.282737
3  Venüs  0.546356 -0.406516       0.537400

In [28]:
yeniIndexsListesi = ["sem","tol","mel","ven"]

In [29]:
yeniDataFrame["Yeni Index"] = yeniIndexsListesi

In [30]:
yeniDataFrame

           Maaş       Yaş  Çalışma Saati Yeni Index
Sema  -0.550577 -0.436143      -1.342918        sem
Tolga -0.994354  1.661687      -0.982017        tol
Melis  0.921920 -0.567407      -0.282737        mel
Venüs  0.546356 -0.406516       0.537400        ven

In [31]:
yeniDataFrame.set_index("Yeni Index")

                Maaş       Yaş  Çalışma Saati
Yeni Index
sem        -0.550577 -0.436143      -1.342918
tol        -0.994354  1.661687      -0.982017
mel         0.921920 -0.567407      -0.282737
ven         0.546356 -0.406516       0.537400

In [32]:
yeniDataFrame

           Maaş       Yaş  Çalışma Saati Yeni Index
Sema  -0.550577 -0.436143      -1.342918        sem
Tolga -0.994354  1.661687      -0.982017        tol
Melis  0.921920 -0.567407      -0.282737        mel
Venüs  0.546356 -0.406516       0.537400        ven

In [33]:
yeniDataFrame.set_index("Yeni Index", inplace=True)

In [34]:
yeniDataFrame

                Maaş       Yaş  Çalışma Saati
Yeni Index
sem        -0.550577 -0.436143      -1.342918
tol        -0.994354  1.661687      -0.982017
mel         0.921920 -0.567407      -0.282737
ven         0.546356 -0.406516       0.537400

# Multi Index

In [43]:
ilkIndexler = ["İnal","İnal","İnal","İnal","Köçken","Köçken","Köçken","Köçken"]

In [44]:
icIndexler = ["Sema","Tolga","Melis","Venüs","Nil","Gökay","Peri","Pars"]

In [45]:
birlesmisIndex = list(zip(ilkIndexler,icIndexler))

In [46]:
birlesmisIndex

[('İnal', 'Sema'),
 ('İnal', 'Tolga'),
 ('İnal', 'Melis'),
 ('İnal', 'Venüs'),
 ('Köçken', 'Nil'),
 ('Köçken', 'Gökay'),
 ('Köçken', 'Peri'),
 ('Köçken', 'Pars')]

In [47]:
birlesmisIndex = pd.MultiIndex.from_tuples(birlesmisIndex)

In [48]:
birlesmisIndex

MultiIndex([(  'İnal',  'Sema'),
            (  'İnal', 'Tolga'),
            (  'İnal', 'Melis'),
            (  'İnal', 'Venüs'),
            ('Köçken',   'Nil'),
            ('Köçken', 'Gökay'),
            ('Köçken',  'Peri'),
            ('Köçken',  'Pars')],
           )

In [49]:
benimAileListem = [[35,"a"],[35,"b"],[5,"c"],[2,"d"],[35,"e"],[36,"f"],[4,"g"],[1,"h"]]

In [52]:
benimAileNumpyDizim = np.array(benimAileListem)

In [54]:
benimAileDataFrame = pd.DataFrame(benimAileNumpyDizim,index=birlesmisIndex,columns=["Yaş","Meslek"])

In [55]:
benimAileDataFrame

             Yaş Meslek
İnal   Sema   35      a
       Tolga  35      b
       Melis   5      c
       Venüs   2      d
Köçken Nil    35      e
       Gökay  36      f
       Peri    4      g
       Pars    1      h

In [56]:
benimAileDataFrame.loc["İnal"]

      Yaş Meslek
Sema   35      a
Tolga  35      b
Melis   5      c
Venüs   2      d

In [57]:
benimAileDataFrame.loc["İnal"].loc["Sema"]

Yaş       35
Meslek     a
Name: Sema, dtype: object

In [58]:
benimAileDataFrame.index.names = ["Aile","İsim"]

In [59]:
benimAileDataFrame

             Yaş Meslek
Aile   İsim
İnal   Sema   35      a
       Tolga  35      b
       Melis   5      c
       Venüs   2      d
Köçken Nil    35      e
       Gökay  36      f
       Peri    4      g
       Pars    1      h